Autodesk.Revit.DB.TagOrientation
An enumerated type listing tag orientation options that are supported by IndependentTags.

Autodesk.Revit.DB.TagOrientation.Vertical
The Orientation of tag is Vertical.

Autodesk.Revit.DB.TagOrientation.Horizontal
The Orientation of tag is Horizontal.